[
  {
    "title": "Sources of Air Pollution",
    "ques": "Identify the primary sources of air pollution and categorize them into natural and anthropogenic sources.",
    "answer": {
      "type": "text",
      "content": "Primary sources of air pollution:\nNatural: Volcanic eruptions, forest fires, pollen dispersal.\nAnthropogenic: Vehicular emissions, industrial discharge, burning of fossil fuels."
    },
    "explanation": "***Natural sources*** include events that occur in nature such as ```volcanic eruptions```, which emit gases like SO₂; ***forest fires*** that release CO and particulate matter; and ***pollen dispersal***, which contributes to bioaerosols.\n***Anthropogenic sources*** refer to human activities such as ```vehicular emissions```, which release NOx and CO; ```industrial discharge```, which can include sulfur compounds and hydrocarbons; and ```burning of fossil fuels```, which leads to CO₂ and SO₂ emissions."
  },
  {
    "title": "Effects of Water Pollution",
    "ques": "What are the major effects of water pollution on aquatic life and human health?",
    "answer": {
      "type": "text",
      "content": "Water pollution affects aquatic life by reducing oxygen levels, causing death of organisms, and disrupting ecosystems.\nIt affects human health by causing diseases such as cholera, dysentery, and heavy metal poisoning."
    },
    "explanation": "***Aquatic effects*** include ```eutrophication```, where excess nutrients promote algal blooms that consume oxygen, making the water hypoxic.\nThis leads to ***fish kills*** and loss of biodiversity.\n***Human health*** impacts arise from drinking or coming into contact with ```contaminated water```, leading to ***waterborne diseases*** like ***cholera*** and exposure to toxins like ```mercury```, causing ***neurological damage***."
  },
  {
    "title": "Soil Pollution Causes",
    "ques": "List and explain the major causes of soil pollution.",
    "answer": {
      "type": "text",
      "content": "Major causes of soil pollution include:\n1. Excessive use of chemical fertilizers and pesticides\n2. Industrial waste dumping\n3. Improper disposal of solid waste\n4. Oil spills and mining activities"
    },
    "explanation": "***Chemical fertilizers and pesticides*** introduce harmful substances like ```nitrates``` and ```organophosphates```, which accumulate and degrade soil quality.\n***Industrial waste***, often containing heavy metals like ```lead``` and ```arsenic```, pollutes the soil.\n***Solid waste disposal***, especially non-biodegradable plastics, alters soil structure and fertility.\n***Oil spills and mining*** add hydrocarbons and heavy metals, disrupting microbial and plant life."
  },
  {
    "title": "Greenhouse Gases Identification",
    "ques": "Which gases are classified as greenhouse gases and how do they contribute to global warming?",
    "answer": {
      "type": "text",
      "content": "Greenhouse gases include:\n1. Carbon dioxide (CO₂)\n2. Methane (CH₄)\n3. Nitrous oxide (N₂O)\n4. Water vapor (H₂O)\n5. Ozone (O₃)\nThese gases trap heat in the Earth's atmosphere, leading to global warming."
    },
    "explanation": "***Greenhouse gases*** absorb infrared radiation emitted by the Earth’s surface and re-radiate it back, causing a ***warming effect***.\n```CO₂``` is produced from burning fossil fuels; ```CH₄``` from agriculture and landfills; ```N₂O``` from fertilizers; ```H₂O``` is naturally present and amplifies the warming; ```O₃``` in the lower atmosphere also acts as a greenhouse gas.\nThis leads to ***rising global temperatures, melting glaciers, and extreme weather events***."
  },
  {
    "title": "Ozone Layer Depletion",
    "ques": "Explain how chlorofluorocarbons (CFCs) contribute to ozone layer depletion.",
    "answer": {
      "type": "text",
      "content": "CFCs released into the atmosphere break down under UV radiation, releasing chlorine atoms.\nThese chlorine atoms react with ozone molecules, breaking them down and depleting the ozone layer."
    },
    "explanation": "***CFCs*** are stable compounds used in refrigerants and aerosols.\nIn the stratosphere, UV rays break CFCs down, releasing ```chlorine radicals```.\nThese radicals catalytically destroy ozone: ***Cl + O₃ → ClO + O₂*** and ***ClO + O → Cl + O₂***.\nOne chlorine atom can destroy thousands of ozone molecules, leading to ***ozone layer thinning*** and increased UV radiation reaching Earth."
  },
  {
    "title": "Principle of Green Chemistry",
    "ques": "Describe the principle of 'prevention' in green chemistry.",
    "answer": {
      "type": "text",
      "content": "The principle of prevention states that it is better to prevent waste than to treat or clean it up after it is formed."
    },
    "explanation": "The ***prevention principle*** emphasizes designing chemical processes that minimize or eliminate the production of hazardous substances.\nInstead of managing pollution after it occurs, green chemistry encourages **proactive strategies** like ```using catalytic instead of stoichiometric reagents``` or ```choosing safer solvents```.\nThis results in ***cost efficiency, environmental safety, and sustainability***."
  },
  {
    "title": "Biodegradable vs Non-Biodegradable",
    "ques": "Differentiate between biodegradable and non-biodegradable pollutants with examples.",
    "answer": {
      "type": "text",
      "content": "Biodegradable pollutants are broken down by natural processes (e.g., food waste, paper).\nNon-biodegradable pollutants do not degrade easily (e.g., plastic, heavy metals)."
    },
    "explanation": "***Biodegradable pollutants*** decompose through microbial activity and include ```organic waste, sewage, and agricultural residues```.\nThey pose less long-term harm but can cause immediate issues like eutrophication.\n***Non-biodegradable pollutants*** persist in the environment, like ```plastic bags, DDT, and mercury```.\nThese accumulate in ecosystems, leading to ***bioaccumulation*** and ***long-term ecological damage***."
  },
  {
    "title": "Smog Formation",
    "ques": "What is photochemical smog? Describe the chemical reactions involved in its formation.",
    "answer": {
      "type": "text",
      "content": "Photochemical smog is a type of air pollution formed when sunlight reacts with nitrogen oxides (NOx) and volatile organic compounds (VOCs) in the atmosphere.\nIt results in the formation of ground-level ozone (O₃), peroxyacetyl nitrate (PAN), and other oxidants."
    },
    "explanation": "***Photochemical smog*** forms primarily in urban areas with high traffic.\nSunlight initiates reactions: ```NO₂ → NO + O``` and then ```O + O₂ → O₃```.\nOzone then reacts with VOCs to form ***PAN and other photochemical oxidants***.\nThese are harmful to lungs, vegetation, and contribute to ***eye irritation and respiratory problems***."
  },
  {
    "title": "Thermal Pollution Impact",
    "ques": "How does thermal pollution affect aquatic ecosystems?",
    "answer": {
      "type": "text",
      "content": "Thermal pollution raises the temperature of water bodies, reducing dissolved oxygen levels.\nThis affects aquatic organisms' metabolism and can lead to death or migration."
    },
    "explanation": "***Thermal pollution*** is usually caused by ```discharge of heated water``` from industries or power plants.\nHigher temperatures lower ***oxygen solubility*** in water, stressing fish and aquatic life.\nMetabolic rates increase, but oxygen availability drops, causing ***suffocation, altered reproduction cycles, and habitat loss***."
  },
  {
    "title": "Bioaccumulation in Soil",
    "ques": "Explain how soil pollution leads to bioaccumulation. Give one example.",
    "answer": {
      "type": "text",
      "content": "Soil pollutants like heavy metals can be absorbed by plants and enter the food chain.\nOver time, these toxins accumulate in organisms—a process called bioaccumulation.\nExample: Lead in contaminated soil entering crops and harming humans."
    },
    "explanation": "***Bioaccumulation*** occurs when pollutants like ```lead, cadmium, or mercury``` enter plants via roots.\nHerbivores eat these plants, and the toxins move up the food chain.\nBecause these pollutants are ***non-biodegradable***, their concentration increases in higher trophic levels, leading to ***chronic toxicity, neurological issues, and organ damage***."
  },
  {
    "title": "Ozone Layer Function",
    "ques": "What is the role of the ozone layer in the Earth's atmosphere and what happens when it depletes?",
    "answer": {
      "type": "text",
      "content": "The ozone layer absorbs harmful ultraviolet (UV) radiation from the Sun.\nWhen it depletes, more UV reaches Earth, increasing risks of skin cancer, cataracts, and affecting ecosystems."
    },
    "explanation": "The ***ozone layer***, found in the stratosphere, blocks over ***97% of harmful UV-B rays***.\nWhen pollutants like ```CFCs``` break down ozone molecules, a ***thinner ozone layer*** lets more UV radiation pass through.\nThis leads to ***health issues in humans, damage to phytoplankton, and disruption of food chains***."
  },
  {
    "title": "Principle: Atom Economy",
    "ques": "Explain the green chemistry principle of atom economy with an example.",
    "answer": {
      "type": "text",
      "content": "Atom economy is the measure of how much of the reactants end up in the desired product.\nA high atom economy means fewer by-products and less waste.\nExample: Using addition reactions instead of substitution."
    },
    "explanation": "***Atom economy*** evaluates the efficiency of a reaction in terms of atom utilization.\nIn reactions where all atoms of reactants become part of the final product, waste is minimized.\nFor instance, in an ```addition reaction``` like ethene + bromine → dibromoethane, ***100% of atoms*** are used.\nThis contrasts with ```substitution reactions``` that create ***unwanted by-products***, reducing sustainability."
  },
  {
    "title": "Carbon Footprint",
    "ques": "What is a carbon footprint and how can individuals reduce it?",
    "answer": {
      "type": "text",
      "content": "A carbon footprint measures the total greenhouse gas emissions caused by an individual, activity, or product.\nIt can be reduced by using public transport, consuming less meat, and saving energy."
    },
    "explanation": "***Carbon footprint*** is expressed in terms of ```CO₂-equivalents``` and includes emissions from transportation, electricity, food, etc.\nTo reduce it:\n- Use energy-efficient appliances\n- Prefer biking or public transit\n- Reduce meat and dairy consumption\n- Support renewable energy\nThese actions contribute to ***lower GHG emissions*** and help combat climate change."
  },
  {
    "title": "Alternative to Traditional Solvents",
    "ques": "According to green chemistry, what are safer alternatives to traditional organic solvents?",
    "answer": {
      "type": "text",
      "content": "Safer alternatives include water, supercritical CO₂, and ionic liquids.\nThese reduce toxicity, volatility, and environmental hazards compared to traditional solvents like benzene or chloroform."
    },
    "explanation": "***Traditional solvents*** like ```benzene``` are toxic, volatile, and flammable.\nGreen chemistry promotes alternatives:\n- ***Water*** is non-toxic and abundant\n- ***Supercritical CO₂*** is recyclable and inert\n- ***Ionic liquids*** are non-volatile and can be tailored for reactions\nUsing such solvents reduces ***health risks and environmental contamination***."
  },
  {
    "title": "Acid Rain Formation",
    "ques": "Explain how acid rain is formed and its environmental consequences.",
    "answer": {
      "type": "text",
      "content": "Acid rain forms when sulfur dioxide (SO₂) and nitrogen oxides (NOₓ) react with water vapor in the atmosphere to produce sulfuric and nitric acids.\nThese acids fall to the ground with precipitation, harming soil, water bodies, and infrastructure."
    },
    "explanation": "***SO₂ and NOₓ*** are released from burning fossil fuels in vehicles and industries.\nThey react with moisture in the air:\n```SO₂ + H₂O → H₂SO₄``` and ```NOₓ + H₂O → HNO₃```\nThe resulting ***acidic precipitation*** lowers the pH of water bodies, damages plant life, leaches nutrients from soil, and corrodes buildings and monuments."
  },
  {
    "title": "Noise Pollution",
    "ques": "What is noise pollution and what are its main sources and effects?",
    "answer": {
      "type": "text",
      "content": "Noise pollution refers to harmful or excessive levels of noise in the environment.\nSources include traffic, industrial activities, construction, and loudspeakers.\nIt can cause hearing loss, stress, and disturbance to wildlife."
    },
    "explanation": "***Noise pollution*** is measured in ```decibels (dB)``` and is considered harmful above certain thresholds.\nMajor sources are ***urban traffic, factories, and public events***.\nIts effects include ***physiological stress, sleep disturbance, hearing damage, and disruption of animal communication and reproduction***."
  },
  {
    "title": "Water Purification Methods",
    "ques": "List two environmentally friendly water purification methods used to reduce water pollution.",
    "answer": {
      "type": "text",
      "content": "Two green methods for water purification:\n1. Constructed wetlands\n2. Activated carbon filtration"
    },
    "explanation": "***Constructed wetlands*** use natural processes involving wetland vegetation, soils, and microbes to treat wastewater by filtering pollutants.\n***Activated carbon filtration*** absorbs organic compounds and removes odors and toxins from water without producing harmful by-products.\nBoth methods are ***sustainable and energy-efficient*** alternatives to chemical treatments."
  },
  {
    "title": "Role of Methane in Climate Change",
    "ques": "Why is methane considered a more potent greenhouse gas than carbon dioxide?",
    "answer": {
      "type": "text",
      "content": "Methane (CH₄) has a higher global warming potential (GWP) than carbon dioxide.\nThough it stays in the atmosphere for a shorter time, it traps much more heat per molecule."
    },
    "explanation": "***Global Warming Potential (GWP)*** compares how much heat a greenhouse gas traps in the atmosphere.\nOver 20 years, ***methane's GWP is about 84 times greater than CO₂***.\nSources include ```agriculture (e.g. cattle), landfills, and fossil fuel extraction```.\nReducing methane emissions is critical for ***short-term climate mitigation***."
  },
  {
    "title": "Persistent Organic Pollutants",
    "ques": "What are Persistent Organic Pollutants (POPs)? Give two examples and their effects.",
    "answer": {
      "type": "text",
      "content": "POPs are toxic organic compounds that resist degradation and persist in the environment.\nExamples: DDT and dioxins.\nThey accumulate in living organisms and can cause reproductive and developmental issues."
    },
    "explanation": "***POPs*** are chemical substances that ***bioaccumulate*** and travel long distances through air and water.\n```DDT```, a pesticide, affects the nervous system and causes eggshell thinning in birds.\n```Dioxins```, by-products of industrial processes, are highly toxic and carcinogenic.\nTheir persistence makes them ***global pollutants with serious health and ecological risks***."
  },
  {
    "title": "Ozone vs. Greenhouse Gases",
    "ques": "Differentiate between the roles of ozone in the stratosphere and greenhouse gases in the troposphere.",
    "answer": {
      "type": "text",
      "content": "Stratospheric ozone protects life by absorbing harmful UV radiation.\nGreenhouse gases in the troposphere trap heat, maintaining Earth's temperature.\nHowever, excess greenhouse gases cause global warming."
    },
    "explanation": "***Ozone in the stratosphere*** acts as a shield by absorbing ***UV-B and UV-C rays***, preventing skin cancer and eye damage.\nIn contrast, ***greenhouse gases*** like CO₂ and CH₄ are found in the ***troposphere*** and retain heat through the ***greenhouse effect***.\nWhile both play crucial roles, ***disruption in their balance leads to ozone depletion and climate change*** respectively."
  },
  {
    "title": "Principle: Design for Degradation",
    "ques": "Explain the green chemistry principle of 'Design for Degradation'.",
    "answer": {
      "type": "text",
      "content": "This principle states that chemical products should be designed so they break down into harmless substances after use and do not persist in the environment."
    },
    "explanation": "***Design for Degradation*** ensures that after performing their function, chemicals ***decompose into non-toxic by-products***.\nFor example, biodegradable plastics break down into ```CO₂, H₂O, and biomass``` instead of persisting as waste.\nThis reduces the environmental burden and prevents ***bioaccumulation and long-term pollution***."
  },
  {
    "title": "Heavy Metal Contamination",
    "ques": "How does industrial activity contribute to heavy metal pollution in water and what are its effects?",
    "answer": {
      "type": "text",
      "content": "Industrial discharge often contains heavy metals like mercury, lead, and cadmium.\nThese metals contaminate water sources, bioaccumulate in organisms, and cause health problems like kidney damage and neurological disorders."
    },
    "explanation": "***Heavy metals*** from industries such as mining, battery manufacturing, and paint production enter water systems via ```effluents and runoff```.\nOnce in aquatic environments, they ***bioaccumulate*** in fish and move up the food chain.\nFor example, ```mercury contamination``` can lead to ***Minamata disease*** in humans.\nThese metals are ***non-biodegradable***, making their impact long-term and severe."
  },
  {
    "title": "Soil Salinization",
    "ques": "What is soil salinization and how does it affect agriculture?",
    "answer": {
      "type": "text",
      "content": "Soil salinization occurs when water evaporates from poorly drained irrigated lands, leaving behind salts.\nIt reduces soil fertility and negatively impacts crop yields."
    },
    "explanation": "***Salinization*** is common in arid and semi-arid regions where ***over-irrigation and poor drainage*** cause salt buildup.\nThe accumulation of salts like ```sodium chloride``` in the root zone leads to ***osmotic stress*** in plants, making it harder for roots to absorb water.\nThis results in ***stunted growth, lower productivity, and eventual soil degradation***."
  },
  {
    "title": "Greenhouse Effect Mechanism",
    "ques": "Describe the mechanism of the greenhouse effect in Earth's atmosphere.",
    "answer": {
      "type": "text",
      "content": "Greenhouse gases trap infrared radiation emitted by Earth's surface.\nThis trapped heat increases atmospheric temperature, contributing to the greenhouse effect."
    },
    "explanation": "***Greenhouse gases*** like CO₂, CH₄, and N₂O allow sunlight to pass through the atmosphere.\nEarth's surface absorbs this energy and re-emits it as ***infrared radiation***.\nThese gases then absorb and re-radiate the heat, causing ***warming of the lower atmosphere***.\nThis natural effect maintains livable temperatures, but excess GHGs cause ***global warming***."
  },
  {
    "title": "Biological Indicators of Water Pollution",
    "ques": "How can biological indicators be used to assess water pollution?",
    "answer": {
      "type": "text",
      "content": "The presence or absence of certain aquatic organisms, like mayflies or tubifex worms, indicates water quality.\nSensitive species die in polluted water, while tolerant species may thrive."
    },
    "explanation": "***Biological indicators*** reflect long-term water quality better than chemical tests.\nOrganisms like ```mayflies, stoneflies, and caddisflies``` require clean, oxygen-rich water.\nTheir absence suggests ***high pollution levels***.\nConversely, organisms like ```tubifex worms and bloodworms``` tolerate polluted, low-oxygen conditions.\nUsing these organisms helps ***monitor ecosystem health and guide pollution control***."
  },
  {
    "title": "Photodegradable Plastics",
    "ques": "What are photodegradable plastics and how do they help in reducing soil pollution?",
    "answer": {
      "type": "text",
      "content": "Photodegradable plastics break down when exposed to sunlight.\nThey reduce soil pollution by decomposing into smaller, less harmful substances instead of persisting in the environment."
    },
    "explanation": "***Photodegradable plastics*** contain chemical additives that absorb ```UV radiation``` and trigger decomposition.\nSunlight causes the polymer chains to ***break down into simpler molecules***.\nThis prevents long-term accumulation of plastic waste in soil, helping to ***restore soil aeration and microbial health***."
  },
  {
    "title": "Principle: Safer Chemical Design",
    "ques": "What does the green chemistry principle of 'Designing safer chemicals' entail?",
    "answer": {
      "type": "text",
      "content": "This principle advocates for designing chemicals that fulfill their function with minimal toxicity.\nSafer chemicals reduce risks to human health and the environment during their lifecycle."
    },
    "explanation": "***Designing safer chemicals*** means considering ***hazard and exposure*** during the product design phase.\nFor instance, replacing a toxic solvent like ```benzene``` with a safer alternative like ```ethanol```.\nBy minimizing toxicity, we avoid harm to users and ecosystems, aligning with ***sustainable development and regulatory compliance***."
  },
  {
    "title": "Effect of Cattle Rearing on Methane Emissions",
    "ques": "How does livestock farming contribute to greenhouse gas emissions?",
    "answer": {
      "type": "text",
      "content": "Livestock, especially cattle, produce methane during digestion through enteric fermentation.\nThis methane is released into the atmosphere and contributes significantly to global warming."
    },
    "explanation": "***Enteric fermentation*** occurs in the stomachs of ruminants like cows, producing ```CH₄``` as a by-product.\nMethane is released via belching and is a ***potent greenhouse gas***.\nLivestock farming also involves land clearing and manure management, which further adds to ***GHG emissions and deforestation***."
  },
  {
    "title": "Microplastics in Water",
    "ques": "What are microplastics and how do they contribute to water pollution?",
    "answer": {
      "type": "text",
      "content": "Microplastics are tiny plastic particles less than 5mm in size.\nThey originate from the breakdown of larger plastics or from products like cosmetics and synthetic clothing.\nThese particles pollute water bodies and are ingested by aquatic life."
    },
    "explanation": "***Microplastics*** enter rivers, lakes, and oceans through ```wastewater discharge, runoff, and plastic degradation```.\nThey are consumed by marine organisms, causing ***intestinal blockage, reproductive issues, and toxin transfer up the food chain***.\nTheir small size and persistence make ***removal difficult***, intensifying water pollution."
  },
  {
    "title": "Indoor Air Pollutants",
    "ques": "Name two common indoor air pollutants and mention their health impacts.",
    "answer": {
      "type": "text",
      "content": "1. Formaldehyde – found in furniture and adhesives; causes eye irritation and respiratory problems.\n2. Carbon monoxide – from gas stoves or heaters; causes headaches, dizziness, and in severe cases, death."
    },
    "explanation": "***Indoor air pollutants*** come from common household items and activities.\n```Formaldehyde``` is released from furniture, carpets, and pressed-wood products.\nLong-term exposure can lead to ***asthma and carcinogenic effects***.\n```Carbon monoxide``` forms from incomplete combustion and is ***odorless and deadly at high concentrations***.\nProper ventilation and safer alternatives can reduce these risks."
  },
  {
    "title": "Thermal Inversion and Air Quality",
    "ques": "What is thermal inversion and how does it affect air pollution levels?",
    "answer": {
      "type": "text",
      "content": "Thermal inversion occurs when a layer of warm air traps cooler air near the ground.\nThis prevents pollutants from dispersing, leading to smog and high pollution levels."
    },
    "explanation": "Under normal conditions, ***warm air rises and carries pollutants upward***.\nIn a ***thermal inversion***, a warmer air layer sits above cooler ground-level air, forming a cap.\nThis traps pollutants like ```NOx, SO₂, and particulates``` close to the surface.\nThe result is ***increased smog, reduced visibility, and heightened respiratory issues***, especially in valleys or winter seasons."
  },
  {
    "title": "Effect of Deforestation on Greenhouse Gas Balance",
    "ques": "How does deforestation affect greenhouse gas concentrations in the atmosphere?",
    "answer": {
      "type": "text",
      "content": "Deforestation reduces the number of trees that absorb CO₂.\nAdditionally, burning or decaying trees release stored carbon into the atmosphere, increasing greenhouse gas levels."
    },
    "explanation": "***Forests act as carbon sinks*** by absorbing carbon dioxide during photosynthesis.\nWhen trees are ***cut or burned***, stored carbon is released as ```CO₂```.\nThis increases ***atmospheric GHG concentrations***, contributing to global warming.\nDeforestation also disturbs local climates, affects rainfall patterns, and destroys carbon-regulating ecosystems."
  },
  {
    "title": "Eco-friendly Catalysts",
    "ques": "What is the role of catalysts in green chemistry? Give one eco-friendly example.",
    "answer": {
      "type": "text",
      "content": "Catalysts speed up chemical reactions without being consumed.\nIn green chemistry, they reduce the need for high temperatures and excess reagents.\nExample: Enzymes used in bio-based reactions."
    },
    "explanation": "***Catalysts*** improve reaction efficiency and minimize waste.\nUsing them enables reactions to occur under ***milder conditions***, conserving energy.\n```Enzymes``` are eco-friendly catalysts that work in aqueous solutions at room temperature.\nThey are biodegradable and reduce the formation of ***unwanted by-products***, making chemical processes cleaner and safer."
  },
  {
    "title": "Soil Erosion by Pollutants",
    "ques": "How do chemical pollutants contribute to soil erosion?",
    "answer": {
      "type": "text",
      "content": "Chemical pollutants degrade soil structure and reduce microbial life, making the soil loose and more prone to erosion by wind or water."
    },
    "explanation": "***Pollutants*** like ```acid rain, heavy metals, and industrial effluents``` alter the pH and nutrient content of soil.\nThey damage ***soil biota*** such as earthworms and bacteria, which are crucial for maintaining structure.\nDegraded soil loses its ability to retain water and nutrients, becoming more ***susceptible to erosion and loss of fertility***."
  },
  {
    "title": "Chlorofluorocarbons (CFCs)",
    "ques": "Why are CFCs banned in many countries and what are their environmental effects?",
    "answer": {
      "type": "text",
      "content": "CFCs are banned due to their role in ozone layer depletion.\nThey release chlorine atoms in the stratosphere that break down ozone molecules, increasing UV exposure on Earth."
    },
    "explanation": "***Chlorofluorocarbons (CFCs)*** were used in refrigeration, air conditioning, and aerosol sprays.\nIn the stratosphere, UV radiation breaks down CFCs to release ```Cl atoms```.\nEach chlorine atom can destroy thousands of ozone molecules via a catalytic cycle:\n```Cl + O₃ → ClO + O₂```\nThis causes ***ozone thinning***, leading to ***more UV-B rays reaching Earth, causing skin cancers, crop damage, and ecosystem harm***."
  },
  {
    "title": "Biomagnification in Aquatic Ecosystems",
    "ques": "What is biomagnification and how does it relate to water pollution?",
    "answer": {
      "type": "text",
      "content": "Biomagnification is the increase in concentration of pollutants as they move up the food chain.\nWater pollutants like mercury or PCBs accumulate in aquatic organisms and magnify in predators such as large fish and birds."
    },
    "explanation": "***Biomagnification*** occurs when ***toxic substances like mercury, PCBs, or DDT*** enter water bodies through industrial discharge or runoff.\nThese pollutants are absorbed by plankton, then small fish, and finally large fish or birds.\nBecause they are ***non-biodegradable***, concentrations increase at each trophic level, leading to ***toxicity in top consumers, including humans***."
  },
  {
    "title": "Impact of Urban Runoff on Soil",
    "ques": "How does urban runoff contribute to soil pollution?",
    "answer": {
      "type": "text",
      "content": "Urban runoff carries oil, heavy metals, detergents, and other contaminants from roads and pavements into soil.\nThis alters soil chemistry and harms plant and microbial life."
    },
    "explanation": "***Urban runoff*** is rainwater that flows over ***impervious surfaces*** like roads and rooftops.\nIt picks up ***pollutants such as motor oil, rubber particles, fertilizers, and detergents***.\nWhen this runoff seeps into soil, it ***disrupts microbial communities, alters pH, and reduces fertility***.\nOver time, it leads to ***loss of vegetation and erosion***."
  },
  {
    "title": "Ocean Acidification and CO₂",
    "ques": "Explain how increased atmospheric CO₂ leads to ocean acidification.",
    "answer": {
      "type": "text",
      "content": "CO₂ dissolves in ocean water forming carbonic acid.\nThis lowers the pH of seawater, affecting marine life like corals and shell-forming organisms."
    },
    "explanation": "***CO₂ from the atmosphere*** dissolves in oceans and reacts with water:\n```CO₂ + H₂O → H₂CO₃ (carbonic acid)```\nThis acid dissociates to release ***H⁺ ions***, lowering pH.\nLower pH affects the availability of carbonate ions needed for ***shell and coral skeleton formation***.\nThis weakens marine ecosystems and disrupts biodiversity."
  },
  {
    "title": "Solvent Replacement in Green Chemistry",
    "ques": "Why is replacing traditional solvents a key goal in green chemistry?",
    "answer": {
      "type": "text",
      "content": "Traditional solvents are often toxic, volatile, and non-renewable.\nGreen chemistry promotes safer alternatives like water, ethanol, or supercritical CO₂ to minimize environmental and health risks."
    },
    "explanation": "***Conventional solvents*** like benzene, chloroform, and toluene are ***flammable, carcinogenic, and volatile***.\nTheir disposal also causes ***soil and water pollution***.\nGreen chemistry focuses on safer solvents such as ```water, ionic liquids, or supercritical CO₂```, which are ***less toxic, reusable, and environmentally benign***.\nThis change improves ***worker safety and reduces waste generation***."
  },
  {
    "title": "Noise Pollution and Wildlife",
    "ques": "How does noise pollution affect wildlife in natural ecosystems?",
    "answer": {
      "type": "text",
      "content": "Noise pollution disrupts animal communication, mating rituals, and navigation.\nIt can lead to habitat abandonment and stress in wildlife."
    },
    "explanation": "***Many species*** rely on sound for ***communication, predator detection, and navigation***.\nHuman-generated noise from ***traffic, construction, and industries*** interferes with these processes.\nFor example, ***birds may fail to attract mates***, and ***marine mammals like whales may become disoriented***.\nProlonged noise can lead to ***chronic stress and migration from natural habitats***."
  },
  {
    "title": "Ozone Layer and UV Radiation",
    "ques": "How does the ozone layer protect living organisms from UV radiation?",
    "answer": {
      "type": "text",
      "content": "The ozone layer absorbs harmful UV-B and UV-C radiation from the sun.\nThis protects organisms from DNA damage, skin cancer, and immune suppression."
    },
    "explanation": "***O₃ molecules in the stratosphere*** absorb ***high-energy ultraviolet radiation***:\n```O₃ + UV → O₂ + O```\nThis reaction ***filters out UV-B and UV-C rays*** before they reach Earth's surface.\nWithout the ozone layer, organisms would face ***mutations, increased cancer risk, and damage to plant productivity and plankton populations***."
  },
  {
    "title": "Eco-friendly Packaging",
    "ques": "Describe one example of a green chemistry application in product packaging.",
    "answer": {
      "type": "text",
      "content": "Biodegradable packaging made from starch or plant fibers is a green alternative to plastic.\nIt breaks down naturally and reduces landfill waste and soil pollution."
    },
    "explanation": "***Green chemistry in packaging*** aims to reduce reliance on ***non-degradable plastics***.\nMaterials like ```corn starch, cellulose, or algae-based polymers``` are used to create packaging that ***biodegrades in soil or compost***.\nThese options reduce ***microplastic contamination*** and support ***zero-waste and circular economy principles***."
  }
]