[
  {
    "title": "Prokaryotic vs. Eukaryotic Cells",
    "ques": "Differentiate between prokaryotic and eukaryotic cells by listing any three key differences.",
    "answer": {
      "type": "text",
      "content": "1. Prokaryotic cells lack a nucleus, whereas eukaryotic cells have a true nucleus.\n2. Prokaryotic cells do not contain membrane-bound organelles; eukaryotic cells do.\n3. DNA in prokaryotes is circular and free-floating, while in eukaryotes, it is linear and enclosed within the nucleus."
    },
    "explanation": "***1. Nucleus***: Prokaryotes such as bacteria do not have a membrane-bound nucleus. Their genetic material is located in a region called the ```nucleoid```. Eukaryotic cells, like those in plants and animals, have a well-defined nucleus enclosed by a membrane.\n***2. Organelles***: Membrane-bound organelles like mitochondria, ER, and Golgi bodies are present in eukaryotes but absent in prokaryotes.\n***3. DNA structure***: Prokaryotic DNA is usually a single, circular molecule, whereas eukaryotic DNA is organized into chromosomes housed in the nucleus."
  },
  {
    "title": "Stages of Mitosis",
    "ques": "List and describe the main stages of mitosis in order.",
    "answer": {
      "type": "text",
      "content": "1. Prophase\n2. Metaphase\n3. Anaphase\n4. Telophase\n5. Cytokinesis"
    },
    "explanation": "***Prophase***: Chromosomes condense and become visible. The nuclear envelope starts to disintegrate, and spindle fibers begin to form.\n***Metaphase***: Chromosomes align at the cell's equator, attached to spindle fibers by their centromeres.\n***Anaphase***: Sister chromatids are pulled apart toward opposite poles of the cell.\n***Telophase***: Nuclear envelopes reform around the two sets of chromosomes. The chromosomes begin to de-condense.\n***Cytokinesis***: Division of the cytoplasm occurs, resulting in two daughter cells."
  },
  {
    "title": "Function of Chloroplast",
    "ques": "What is the primary function of chloroplasts in plant cells?",
    "answer": {
      "type": "text",
      "content": "Chloroplasts carry out photosynthesis, converting light energy into chemical energy in the form of glucose."
    },
    "explanation": "***Chloroplasts*** are organelles found in plant and some algal cells.\nThey contain the pigment ***chlorophyll***, which captures sunlight.\nThrough the process of ```photosynthesis```, they convert light energy, carbon dioxide, and water into glucose and oxygen.\nThis is essential for providing energy to the plant and producing oxygen for other organisms."
  },
  {
    "title": "Comparison of Photosynthesis and Respiration",
    "ques": "Compare photosynthesis and cellular respiration by listing two differences.",
    "answer": {
      "type": "text",
      "content": "1. Photosynthesis occurs in chloroplasts; respiration occurs in mitochondria.\n2. Photosynthesis converts CO₂ and H₂O into glucose and O₂; respiration breaks down glucose into CO₂ and H₂O."
    },
    "explanation": "***Location***: Photosynthesis takes place in the ```chloroplasts``` of plant cells, while cellular respiration takes place in the ```mitochondria``` of both plant and animal cells.\n***Process***: Photosynthesis uses light energy to synthesize glucose, storing energy. Cellular respiration releases energy by breaking down glucose molecules.\nSo, photosynthesis is an ***anabolic*** process (building up), and respiration is ***catabolic*** (breaking down)."
  },
  {
    "title": "Osmosis Definition",
    "ques": "Define osmosis and give an example from a biological system.",
    "answer": {
      "type": "text",
      "content": "Osmosis is the movement of water across a semipermeable membrane from a region of lower solute concentration to a region of higher solute concentration.\nExample: Water moving into plant root cells from the soil."
    },
    "explanation": "***Osmosis*** is a type of passive transport that does not require energy.\nIt involves the movement of water molecules through a selectively permeable membrane.\nWater moves to balance the concentration of solutes on both sides of the membrane.\nIn plants, osmosis helps in water absorption from the soil, keeping cells turgid and maintaining structure."
  },
  {
    "title": "Active vs Passive Transport",
    "ques": "What is the main difference between active and passive transport across membranes?",
    "answer": {
      "type": "text",
      "content": "Active transport requires energy (ATP), while passive transport does not."
    },
    "explanation": "***Active transport*** moves substances against their concentration gradient (from low to high), using cellular energy in the form of ```ATP```.\n***Passive transport*** (like diffusion and osmosis) moves substances down their concentration gradient (from high to low) without using energy.\nExample of active: Sodium-potassium pump.\nExample of passive: Oxygen diffusing into blood from alveoli."
  },
  {
    "title": "Function of Ribosomes",
    "ques": "What is the primary role of ribosomes in both prokaryotic and eukaryotic cells?",
    "answer": {
      "type": "text",
      "content": "Ribosomes are responsible for synthesizing proteins by translating messenger RNA (mRNA)."
    },
    "explanation": "***Ribosomes*** are found in both prokaryotic and eukaryotic cells.\nThey are the site of ***protein synthesis***, where they decode the genetic instructions carried by ```mRNA``` to assemble amino acids into proteins.\nIn ***eukaryotic cells***, ribosomes can be found floating freely in the cytoplasm or attached to the endoplasmic reticulum (making it 'rough').\nIn ***prokaryotic cells***, they float freely in the cytoplasm since there is no internal membrane structure."
  },
  {
    "title": "Crossing Over in Meiosis",
    "ques": "During which phase of meiosis does crossing over occur, and why is it important?",
    "answer": {
      "type": "text",
      "content": "Crossing over occurs during Prophase I of meiosis.\nIt is important because it increases genetic variation by exchanging genetic material between homologous chromosomes."
    },
    "explanation": "***Prophase I*** is a stage in meiosis where homologous chromosomes pair up and exchange segments of genetic material.\nThis process is known as ***crossing over***.\nIt occurs at regions called ```chiasmata```.\nThis genetic recombination results in ***greater diversity*** among offspring, which is important for evolution and adaptation."
  },
  {
    "title": "ATP Production in Cellular Respiration",
    "ques": "Which organelle is primarily responsible for ATP production during cellular respiration, and what process occurs there?",
    "answer": {
      "type": "text",
      "content": "The mitochondrion is responsible for ATP production through the process of aerobic respiration."
    },
    "explanation": "The ***mitochondria*** are known as the \"powerhouse\" of the cell.\nThey perform ***aerobic respiration***, which includes glycolysis (in cytoplasm), the Krebs cycle, and the electron transport chain (in the mitochondria).\nMost of the ATP is generated in the ```electron transport chain```, which uses oxygen as the final electron acceptor.\nThe energy from glucose is converted into ***ATP***, the energy currency of the cell."
  },
  {
    "title": "Facilitated Diffusion Example",
    "ques": "Give one example of a molecule that moves through the membrane using facilitated diffusion and name the protein involved.",
    "answer": {
      "type": "text",
      "content": "Glucose moves into cells using facilitated diffusion through a protein called GLUT transporter."
    },
    "explanation": "***Facilitated diffusion*** is a form of passive transport where molecules move down their concentration gradient with the help of membrane proteins.\n***Glucose*** is too large and polar to pass directly through the lipid bilayer, so it uses a ```GLUT``` transporter protein.\nNo energy is used, and the process is selective and regulated."
  },
  {
    "title": "Unique Feature of Plant Cells",
    "ques": "Which organelle is found only in plant cells and not in animal cells, and what is its function?",
    "answer": {
      "type": "text",
      "content": "The central vacuole is unique to plant cells and helps maintain turgor pressure and store nutrients."
    },
    "explanation": "The ***central vacuole*** is a large, membrane-bound organelle found in plant cells.\nIt stores water, ions, and nutrients.\nIts main function is to maintain ***turgor pressure*** against the cell wall, keeping the plant rigid and upright.\nThis organelle also plays a role in waste disposal and pigment storage.\nAnimal cells have small vacuoles, but not a large central one like in plants."
  },
  {
    "title": "Endocytosis vs. Exocytosis",
    "ques": "Differentiate between endocytosis and exocytosis in terms of direction and function.",
    "answer": {
      "type": "text",
      "content": "Endocytosis brings substances into the cell; exocytosis expels substances out of the cell."
    },
    "explanation": "***Endocytosis*** is the process by which cells engulf external substances, enclosing them in a vesicle that is brought into the cell.\nThere are types like ```phagocytosis``` (cell eating) and ```pinocytosis``` (cell drinking).\n***Exocytosis*** is the reverse process—vesicles within the cell fuse with the membrane to release substances outside.\nBoth processes require ***energy (ATP)*** and are forms of ***active transport***."
  },
  {
    "title": "Cell Wall Function",
    "ques": "What is the function of the cell wall in plant cells, and how does it differ from the cell membrane?",
    "answer": {
      "type": "text",
      "content": "The cell wall provides structural support and protection to plant cells.\nUnlike the cell membrane, it is rigid and made of cellulose."
    },
    "explanation": "The ***cell wall*** is a tough, rigid layer that surrounds plant cells.\nIt is composed primarily of ```cellulose```, a polysaccharide that gives it strength.\nIts main roles are to provide ***structural support***, maintain cell shape, and protect against mechanical stress.\nUnlike the ***cell membrane***, which is flexible and found in all cells, the cell wall is only found in ***plant, fungal, and bacterial cells***."
  },
  {
    "title": "Centrioles in Cell Division",
    "ques": "What is the role of centrioles during mitosis in animal cells?",
    "answer": {
      "type": "text",
      "content": "Centrioles help organize the spindle fibers that separate chromosomes during mitosis."
    },
    "explanation": "***Centrioles*** are cylindrical structures found in animal cells.\nDuring ***mitosis***, they move to opposite poles of the cell and assist in forming the ```mitotic spindle```.\nThis spindle is responsible for aligning and pulling apart chromosomes.\nCentrioles ensure accurate ***chromosome segregation***, which is essential for producing genetically identical daughter cells."
  },
  {
    "title": "Outcome of Meiosis",
    "ques": "What is the final result of meiosis in terms of chromosome number and cell type?",
    "answer": {
      "type": "text",
      "content": "Meiosis produces four haploid gametes, each with half the number of chromosomes as the original cell."
    },
    "explanation": "***Meiosis*** is a two-part cell division process that occurs in ***sex cells*** (gametes).\nIt reduces the chromosome number by half, turning a diploid (2n) cell into four haploid (n) cells.\nThis ensures that when fertilization occurs, the resulting zygote has the correct diploid number.\nThe process promotes ***genetic diversity*** through independent assortment and crossing over."
  },
  {
    "title": "Light-Dependent Reactions",
    "ques": "Where do the light-dependent reactions of photosynthesis occur, and what is produced?",
    "answer": {
      "type": "text",
      "content": "They occur in the thylakoid membranes of the chloroplast and produce ATP and NADPH."
    },
    "explanation": "***Light-dependent reactions*** take place in the ```thylakoid membranes``` inside chloroplasts.\nWhen light hits chlorophyll, it excites electrons, starting a chain reaction known as the ***electron transport chain***.\nWater is split (photolysis), releasing oxygen.\nThe reactions produce ***ATP*** and ***NADPH***, which are then used in the Calvin cycle to fix carbon dioxide into glucose."
  },
  {
    "title": "Effect of Temperature on Diffusion",
    "ques": "How does increasing temperature affect the rate of diffusion across a membrane?",
    "answer": {
      "type": "text",
      "content": "Increasing temperature increases the rate of diffusion across the membrane."
    },
    "explanation": "Diffusion is the passive movement of particles from an area of high concentration to low concentration.\n***Temperature*** affects the kinetic energy of molecules.\nWhen temperature increases, molecules move faster, causing more frequent and forceful collisions.\nThis leads to a ***faster rate of diffusion*** across the membrane.\nNo energy (ATP) is required in this process—it remains ***passive transport***."
  },
  {
    "title": "Plasmolysis in Plant Cells",
    "ques": "What happens to a plant cell placed in a highly concentrated salt solution, and what is the term for this process?",
    "answer": {
      "type": "text",
      "content": "The cell loses water and shrinks away from the cell wall. This process is called plasmolysis."
    },
    "explanation": "When a plant cell is placed in a ***hypertonic*** solution (higher solute concentration outside), water moves out of the cell by ***osmosis***.\nAs a result, the vacuole shrinks and the cell membrane pulls away from the cell wall.\nThis process is known as ***plasmolysis***.\nIt can cause wilting and impaired function in plant tissues."
  },
  {
    "title": "Nucleoid Region in Prokaryotes",
    "ques": "What is the nucleoid region in a prokaryotic cell and how does it differ from a nucleus in eukaryotic cells?",
    "answer": {
      "type": "text",
      "content": "The nucleoid is an irregular region in a prokaryotic cell that contains the genetic material.\nUnlike the nucleus in eukaryotic cells, it is not surrounded by a membrane."
    },
    "explanation": "In ***prokaryotic cells***, the genetic material (DNA) is located in the ```nucleoid```, which is not a membrane-bound organelle.\nIn contrast, ***eukaryotic cells*** have a true ***nucleus*** that is surrounded by a nuclear envelope.\nThe nucleoid allows quick access to DNA but lacks the compartmentalization provided by a nucleus."
  },
  {
    "title": "Interphase in Cell Cycle",
    "ques": "What happens during interphase in the cell cycle, and why is it important before mitosis begins?",
    "answer": {
      "type": "text",
      "content": "During interphase, the cell grows, performs normal functions, and duplicates its DNA in preparation for mitosis."
    },
    "explanation": "***Interphase*** consists of three subphases: G1 (growth), S (DNA synthesis), and G2 (preparation for division).\nIt is not part of mitosis but is ***essential*** for preparing the cell.\nIn the ```S phase```, the DNA is replicated so that each daughter cell will have an identical set of chromosomes after division.\nWithout interphase, cells would not have the materials needed to divide properly."
  },
  {
    "title": "Stomata and Gas Exchange",
    "ques": "What role do stomata play in photosynthesis, and where are they located?",
    "answer": {
      "type": "text",
      "content": "Stomata are small pores on the underside of leaves that allow gas exchange, letting in carbon dioxide and releasing oxygen."
    },
    "explanation": "***Stomata*** are found mainly on the ```lower epidermis``` of plant leaves.\nThey are controlled by ***guard cells*** that open and close the pore.\nDuring photosynthesis, stomata open to allow ***carbon dioxide*** to enter the leaf.\nThey also release ***oxygen***, a byproduct of photosynthesis, and regulate water loss through ***transpiration***."
  },
  {
    "title": "Glycolysis Location",
    "ques": "Where does glycolysis occur in the cell, and what is its main product?",
    "answer": {
      "type": "text",
      "content": "Glycolysis occurs in the cytoplasm and produces two molecules of pyruvate along with ATP and NADH."
    },
    "explanation": "***Glycolysis*** is the first step in ***cellular respiration*** and takes place in the ```cytoplasm```, not in mitochondria.\nIt breaks down one glucose molecule into ***two pyruvate*** molecules.\nThis process also generates ***2 ATP*** and ***2 NADH***.\nIt does not require oxygen and is therefore an ***anaerobic*** process.\nPyruvate then enters the mitochondria for further breakdown if oxygen is present."
  },
  {
    "title": "Simple Diffusion Example",
    "ques": "Give an example of a molecule that moves by simple diffusion across the cell membrane.",
    "answer": {
      "type": "text",
      "content": "Oxygen moves across the cell membrane by simple diffusion."
    },
    "explanation": "***Simple diffusion*** is the passive movement of small, nonpolar molecules directly through the lipid bilayer.\n***Oxygen (O₂)*** is a small molecule that moves from an area of high concentration (outside the cell) to low concentration (inside the cell).\nNo transport protein or energy is required.\nThis allows cells to absorb the oxygen they need for ***cellular respiration***."
  },
  {
    "title": "Contractile Vacuole in Protists",
    "ques": "What is the role of the contractile vacuole in freshwater protists like Paramecium?",
    "answer": {
      "type": "text",
      "content": "The contractile vacuole expels excess water from the cell to maintain osmotic balance."
    },
    "explanation": "***Contractile vacuoles*** are organelles found in some unicellular freshwater organisms.\nBecause the surrounding environment is ***hypotonic***, water constantly enters the cell by ***osmosis***.\nThe contractile vacuole collects and actively pumps out this excess water to prevent the cell from ***bursting***.\nThis is an adaptation to maintain ***homeostasis*** in freshwater environments."
  },
  {
    "title": "Chloroplast Structure and Function",
    "ques": "Which part of the chloroplast contains chlorophyll, and what is its main role in photosynthesis?",
    "answer": {
      "type": "text",
      "content": "The thylakoid membranes contain chlorophyll, which captures light energy for photosynthesis."
    },
    "explanation": "***Chloroplasts*** are the site of photosynthesis in plant cells.\nInside them are stacks of membrane-bound structures called ***grana***, made up of ***thylakoids***.\nThe ***thylakoid membrane*** contains the pigment ```chlorophyll```, which absorbs sunlight.\nThis light energy drives the light-dependent reactions that produce ***ATP and NADPH***."
  },
  {
    "title": "Binary Fission in Prokaryotes",
    "ques": "What is the method of cell division in prokaryotic cells, and how does it differ from mitosis?",
    "answer": {
      "type": "text",
      "content": "Prokaryotic cells divide by binary fission, a simpler process than mitosis that does not involve spindle fibers or a nucleus."
    },
    "explanation": "***Binary fission*** is how prokaryotic cells, such as bacteria, reproduce.\nIt involves the replication of the circular DNA molecule, followed by the cell splitting into two identical daughter cells.\nUnlike ***mitosis***, binary fission does not involve a ```nucleus``` or complex phases like prophase or metaphase.\nIt is a ***faster and simpler*** process due to the cell’s structural simplicity."
  },
  {
    "title": "Anaphase in Mitosis",
    "ques": "What happens to chromosomes during anaphase of mitosis?",
    "answer": {
      "type": "text",
      "content": "During anaphase, sister chromatids are pulled apart to opposite poles of the cell by spindle fibers."
    },
    "explanation": "In ***anaphase***, the third phase of ***mitosis***, the paired ***sister chromatids*** separate.\nSpindle fibers attached to the centromeres shorten, pulling each chromatid toward opposite sides of the cell.\nThis ensures that each daughter cell receives an ***identical set*** of chromosomes.\nThe separation is crucial for ***genetic stability***."
  },
  {
    "title": "Osmosis and Red Blood Cells",
    "ques": "What happens to a red blood cell placed in a hypotonic solution, and why?",
    "answer": {
      "type": "text",
      "content": "Water enters the red blood cell by osmosis, causing it to swell and potentially burst."
    },
    "explanation": "***Osmosis*** is the movement of water across a semipermeable membrane from low solute to high solute concentration.\nIn a ***hypotonic*** solution, the concentration of solutes outside the cell is lower than inside.\nAs a result, water enters the cell by osmosis.\nRed blood cells can ***swell*** and ***lyse*** (burst), a condition known as ```hemolysis```."
  },
  {
    "title": "Carbon Dioxide in Photosynthesis",
    "ques": "In which phase of photosynthesis is carbon dioxide used, and what is the product?",
    "answer": {
      "type": "text",
      "content": "Carbon dioxide is used during the Calvin cycle to produce glucose."
    },
    "explanation": "The ***Calvin cycle*** is the light-independent phase of ***photosynthesis*** that occurs in the ```stroma``` of the chloroplast.\nIt uses ***carbon dioxide***, along with ATP and NADPH from the light-dependent reactions, to build ***glucose*** molecules.\nThis process is also known as ***carbon fixation***, where inorganic carbon becomes part of an organic compound."
  },
  {
    "title": "Role of the Golgi Apparatus",
    "ques": "What is the function of the Golgi apparatus in a eukaryotic cell?",
    "answer": {
      "type": "text",
      "content": "The Golgi apparatus modifies, sorts, and packages proteins for secretion or use within the cell."
    },
    "explanation": "The ***Golgi apparatus*** is a membrane-bound organelle found in ***eukaryotic cells***.\nIt receives proteins from the ***rough ER***, modifies them (e.g., adding carbohydrates), and packages them into ```vesicles```.\nThese proteins are then either sent to the cell membrane for ***secretion*** or delivered to other parts of the cell.\nThe Golgi acts like a ***shipping and processing center*** for cellular products."
  },
  {
    "title": "Ribosomes in Prokaryotes vs. Eukaryotes",
    "ques": "How do ribosomes in prokaryotic cells differ from those in eukaryotic cells?",
    "answer": {
      "type": "text",
      "content": "Prokaryotic ribosomes are smaller (70S) than eukaryotic ribosomes (80S).\nBoth perform protein synthesis but differ in structure and sensitivity to antibiotics."
    },
    "explanation": "***Ribosomes*** are essential for ***protein synthesis*** in both cell types.\nIn prokaryotes, ribosomes are ```70S``` (composed of 50S and 30S subunits), while in eukaryotes, they are ```80S``` (composed of 60S and 40S subunits).\nThis difference is important because some ***antibiotics*** specifically target 70S ribosomes without affecting 80S ribosomes, allowing selective treatment of bacterial infections."
  },
  {
    "title": "Crossing Over in Meiosis",
    "ques": "What is crossing over in meiosis, and during which stage does it occur?",
    "answer": {
      "type": "text",
      "content": "Crossing over is the exchange of genetic material between homologous chromosomes.\nIt occurs during prophase I of meiosis."
    },
    "explanation": "***Crossing over*** is a key process in ***genetic variation***.\nDuring ```prophase I``` of meiosis, homologous chromosomes pair up in a structure called a ***tetrad***.\nNon-sister chromatids exchange segments of DNA at points called ***chiasmata***.\nThis recombination results in new combinations of alleles in the gametes."
  },
  {
    "title": "ATP Yield from Cellular Respiration",
    "ques": "Approximately how many ATP molecules are produced from one molecule of glucose during aerobic respiration?",
    "answer": {
      "type": "text",
      "content": "Aerobic respiration of one glucose molecule yields about 36–38 ATP molecules."
    },
    "explanation": "***Aerobic respiration*** involves three stages: glycolysis, the Krebs cycle, and the electron transport chain.\nIn total:\n- ```Glycolysis``` yields 2 ATP\n- ```Krebs cycle``` yields 2 ATP\n- ```Electron transport chain``` yields ~32–34 ATP\nAltogether, the process produces ***36–38 ATP*** per glucose molecule, depending on the efficiency and cell type."
  },
  {
    "title": "Facilitated Diffusion and Glucose",
    "ques": "How does glucose enter most animal cells, and what type of membrane transport does this involve?",
    "answer": {
      "type": "text",
      "content": "Glucose enters cells through facilitated diffusion using carrier proteins.\nThis process does not require energy."
    },
    "explanation": "***Facilitated diffusion*** is a form of ***passive transport*** where specific molecules move through the membrane with the help of ```carrier or channel proteins```.\nGlucose, being a large polar molecule, cannot pass through the lipid bilayer directly.\nCarrier proteins allow it to enter down its concentration gradient ***without using ATP***."
  },
  {
    "title": "Smooth ER vs. Rough ER",
    "ques": "What is the difference between the smooth and rough endoplasmic reticulum in terms of structure and function?",
    "answer": {
      "type": "text",
      "content": "Rough ER has ribosomes and synthesizes proteins, while smooth ER lacks ribosomes and synthesizes lipids and detoxifies substances."
    },
    "explanation": "The ***rough ER*** is studded with ```ribosomes```, giving it a 'rough' appearance.\nIt is involved in ***protein synthesis and modification***.\nThe ***smooth ER*** lacks ribosomes and functions in ***lipid synthesis, detoxification, and calcium storage***.\nBoth are part of the ***endomembrane system*** in eukaryotic cells but serve different roles."
  },
  {
    "title": "Telophase in Mitosis",
    "ques": "What key changes occur during telophase of mitosis?",
    "answer": {
      "type": "text",
      "content": "During telophase, nuclear membranes reform around each set of chromosomes, and chromosomes begin to uncoil."
    },
    "explanation": "***Telophase*** is the final stage of ***mitosis*** before cytokinesis.\nDuring this phase, ```nuclear envelopes``` reappear around each group of chromosomes at opposite poles.\nChromosomes begin to ***de-condense*** back into chromatin.\nThe cell prepares to divide its cytoplasm in the next step: ***cytokinesis***."
  },
  {
    "title": "Function of Lysosomes",
    "ques": "What is the primary function of lysosomes in a eukaryotic cell, and what enzymes do they contain?",
    "answer": {
      "type": "text",
      "content": "Lysosomes break down waste and cellular debris using hydrolytic enzymes."
    },
    "explanation": "***Lysosomes*** are membrane-bound organelles found in ***animal cells***.\nThey contain powerful ```hydrolytic enzymes``` that digest worn-out organelles, engulfed bacteria, and other cellular waste.\nThis process helps maintain ***cellular cleanliness*** and can also trigger ***autolysis*** (self-destruction) if the cell is damaged."
  },
  {
    "title": "Cytokinesis in Plant vs. Animal Cells",
    "ques": "How does cytokinesis differ between plant and animal cells?",
    "answer": {
      "type": "text",
      "content": "Animal cells use a cleavage furrow to divide, while plant cells form a cell plate during cytokinesis."
    },
    "explanation": "In ***animal cells***, cytokinesis occurs when the membrane pinches inward forming a ```cleavage furrow```.\nIn ***plant cells***, rigid cell walls prevent pinching, so a ```cell plate``` forms between the nuclei, which eventually becomes the new ***cell wall***.\nBoth processes divide the cytoplasm and complete ***cell division***."
  },
  {
    "title": "Mitochondria as the Powerhouse",
    "ques": "Why are mitochondria often referred to as the 'powerhouse' of the cell?",
    "answer": {
      "type": "text",
      "content": "Mitochondria produce ATP, the main energy currency of the cell, through aerobic respiration."
    },
    "explanation": "***Mitochondria*** are the sites of ***aerobic cellular respiration*** in ***eukaryotic cells***.\nThey convert the energy stored in glucose into ```ATP``` through processes like the **Krebs cycle** and the **electron transport chain**.\nBecause ATP powers nearly all cellular activities, mitochondria are known as the ***powerhouses*** of the cell."
  },
  {
    "title": "Water Movement by Osmosis",
    "ques": "What will happen to a plant cell placed in a hypertonic solution, and why?",
    "answer": {
      "type": "text",
      "content": "Water will move out of the plant cell, causing the cell membrane to shrink away from the cell wall (plasmolysis)."
    },
    "explanation": "In a ***hypertonic*** solution, the concentration of solutes outside the plant cell is higher than inside.\nDue to ***osmosis***, water moves from an area of lower solute concentration (inside the cell) to higher (outside).\nAs water exits, the ```cell membrane``` pulls away from the rigid ```cell wall```, a process called ***plasmolysis***."
  },
  {
    "title": "Role of Centrioles",
    "ques": "What is the function of centrioles in animal cells during cell division?",
    "answer": {
      "type": "text",
      "content": "Centrioles help organize the mitotic spindle that separates chromosomes during cell division."
    },
    "explanation": "***Centrioles*** are cylindrical structures found in ***animal cells***, located in the ```centrosome```.\nDuring ***mitosis and meiosis***, they help form the ***spindle fibers*** that attach to and separate chromosomes.\nWithout properly functioning centrioles, chromosome segregation may be inaccurate."
  },
  {
    "title": "Light vs. Dark Reactions",
    "ques": "What is the main difference between light-dependent and light-independent reactions in photosynthesis?",
    "answer": {
      "type": "text",
      "content": "Light-dependent reactions require sunlight and produce ATP and NADPH; light-independent reactions use those molecules to fix carbon dioxide into glucose."
    },
    "explanation": "***Light-dependent reactions*** occur in the ```thylakoid membranes``` and need sunlight to excite electrons.\nThese reactions produce ***ATP*** and ***NADPH***.\n***Light-independent reactions***, or the ```Calvin cycle```, occur in the ***stroma*** and use those energy molecules to convert ***CO₂ into glucose***.\nSunlight isn't directly required for the dark reactions, but they depend on the products of the light reactions."
  },
  {
    "title": "Peptidoglycan in Prokaryotic Cells",
    "ques": "What structural molecule is found in the cell wall of most prokaryotic cells but not in eukaryotic cells?",
    "answer": {
      "type": "text",
      "content": "Peptidoglycan is found in prokaryotic cell walls but is absent in eukaryotic cells."
    },
    "explanation": "***Peptidoglycan*** is a unique structural polymer made of sugars and amino acids.\nIt forms a mesh-like layer outside the plasma membrane in most ***bacteria*** (prokaryotes).\nEukaryotic cells lack peptidoglycan entirely.\nThis distinction is targeted by antibiotics like ```penicillin```, which disrupt peptidoglycan synthesis, harming bacteria but not human cells."
  },
  {
    "title": "Homologous Chromosomes in Meiosis",
    "ques": "During which stage of meiosis do homologous chromosomes separate, and why is this important?",
    "answer": {
      "type": "text",
      "content": "Homologous chromosomes separate during anaphase I, which reduces the chromosome number by half."
    },
    "explanation": "In ***meiosis I***, homologous chromosomes line up during metaphase I and are pulled apart during ***anaphase I***.\nThis separation is crucial for ***reducing the chromosome number*** from diploid (2n) to haploid (n), ensuring gametes have half the genetic material.\nThis makes meiosis different from mitosis, where ***sister chromatids*** separate instead."
  },
  {
    "title": "Cristae of Mitochondria",
    "ques": "What are cristae in mitochondria, and how do they contribute to cellular respiration?",
    "answer": {
      "type": "text",
      "content": "Cristae are folds in the inner mitochondrial membrane that increase surface area for ATP production."
    },
    "explanation": "***Cristae*** are the highly folded inner membranes inside mitochondria.\nThey provide a large ```surface area``` for the ***electron transport chain*** and ***ATP synthase*** enzymes.\nThis maximizes ATP production during ***aerobic respiration***, making mitochondria extremely efficient at energy conversion."
  },
  {
    "title": "Endocytosis and Active Transport",
    "ques": "How does endocytosis differ from other forms of membrane transport like diffusion?",
    "answer": {
      "type": "text",
      "content": "Endocytosis is an active process that uses energy to engulf large molecules or particles into the cell."
    },
    "explanation": "***Endocytosis*** involves the cell membrane folding inward to form a ```vesicle``` that brings substances inside the cell.\nIt requires ***ATP*** and is used for large molecules like proteins or bacteria.\nUnlike ***diffusion*** or ***osmosis***, which are ***passive*** processes, endocytosis is a form of ***active transport*** because it uses energy."
  },
  {
    "title": "Stomata and Gas Exchange",
    "ques": "What role do stomata play in photosynthesis, and how are they regulated?",
    "answer": {
      "type": "text",
      "content": "Stomata allow the exchange of gases like CO₂ and O₂, and are regulated by guard cells."
    },
    "explanation": "***Stomata*** are small openings on the surface of leaves.\nThey let ```CO₂``` enter for photosynthesis and allow ```O₂``` and water vapor to exit.\nEach stoma is flanked by ***guard cells*** that open or close the pore depending on environmental conditions.\nThis helps balance ***gas exchange*** with ***water conservation***."
  },
  {
    "title": "Golgi Apparatus and Vesicles",
    "ques": "How does the Golgi apparatus interact with vesicles during protein processing?",
    "answer": {
      "type": "text",
      "content": "The Golgi apparatus receives vesicles from the ER, modifies proteins, and sends them out in new vesicles to their destinations."
    },
    "explanation": "Proteins made in the ***rough ER*** are packaged into ```transport vesicles```.\nThese vesicles fuse with the ***cis face*** of the ***Golgi apparatus***.\nInside the Golgi, proteins are ***modified, sorted, and labeled***.\nThey are then packed into new vesicles that bud from the ***trans face*** and move to the cell membrane or other organelles.\nThis ensures accurate ***delivery and functionality*** of proteins."
  },
  {
    "title": "Role of Nucleoid in Prokaryotes",
    "ques": "What is the function of the nucleoid region in prokaryotic cells, and how does it differ from a eukaryotic nucleus?",
    "answer": {
      "type": "text",
      "content": "The nucleoid contains the prokaryotic cell’s DNA, but unlike the eukaryotic nucleus, it is not membrane-bound."
    },
    "explanation": "***Nucleoid*** is the irregularly shaped region in ***prokaryotic cells*** where the single, circular DNA molecule is located.\nUnlike a ***nucleus*** in eukaryotes, the nucleoid is not enclosed by a ```membrane```.\nIt serves as the control center for gene expression and replication in prokaryotes."
  },
  {
    "title": "Sister Chromatids in Mitosis",
    "ques": "What are sister chromatids, and when are they separated during mitosis?",
    "answer": {
      "type": "text",
      "content": "Sister chromatids are identical copies of a chromosome, and they are separated during anaphase of mitosis."
    },
    "explanation": "***Sister chromatids*** form during DNA replication in the ***S phase*** of interphase.\nThey are held together by a ```centromere```.\nIn ***anaphase*** of mitosis, spindle fibers pull the chromatids apart to opposite poles, ensuring each daughter cell receives an identical set of chromosomes."
  },
  {
    "title": "Waste Products of Cellular Respiration",
    "ques": "What are the waste products of aerobic cellular respiration, and how are they expelled from the body?",
    "answer": {
      "type": "text",
      "content": "Carbon dioxide and water are the waste products; CO₂ is exhaled, and water is excreted via urine and sweat."
    },
    "explanation": "During ***aerobic respiration***, glucose reacts with oxygen to produce ```ATP```, ```CO₂```, and ```H₂O```.\nThe ***carbon dioxide*** diffuses into the bloodstream and is expelled by the ***lungs***.\n***Water*** may be used by cells or excreted through ***sweat, urine, or exhalation***."
  },
  {
    "title": "Isotonic Solutions and Cell Volume",
    "ques": "What happens to a cell placed in an isotonic solution, and why?",
    "answer": {
      "type": "text",
      "content": "There is no net movement of water, so the cell maintains its shape and volume."
    },
    "explanation": "In an ***isotonic solution***, the concentration of solutes is the same inside and outside the cell.\nAs a result, ***water moves in and out at equal rates*** through ```osmosis```.\nThis balance keeps the cell in ***equilibrium***, maintaining its size and function without swelling or shrinking."
  },
  {
    "title": "Chloroplast Structure and Function",
    "ques": "How does the structure of the chloroplast support its role in photosynthesis?",
    "answer": {
      "type": "text",
      "content": "Chloroplasts contain thylakoids stacked into grana and stroma where light and dark reactions occur, respectively."
    },
    "explanation": "***Chloroplasts*** have a double membrane and contain internal structures called ```thylakoids```, which are stacked into ```grana```.\nLight-dependent reactions take place in the ***thylakoid membranes***, where pigments like ***chlorophyll*** capture light.\nThe ***stroma*** is the fluid-filled space surrounding the grana, where the ***Calvin cycle*** (light-independent reactions) occurs.\nThis organization optimizes the photosynthesis process."
  },
  {
    "title": "Flagella in Prokaryotes",
    "ques": "What is the function of flagella in prokaryotic cells, and how do they differ structurally from those in eukaryotes?",
    "answer": {
      "type": "text",
      "content": "Flagella in prokaryotes provide motility and are structurally simpler than eukaryotic flagella, rotating like a propeller."
    },
    "explanation": "***Flagella*** in ***prokaryotes*** are composed of a protein called ```flagellin``` and rotate to propel the cell.\nThey are anchored by a ***basal body*** in the cell membrane and move like a ***rotating motor***.\nEukaryotic flagella, by contrast, have a ```9+2 microtubule arrangement``` and move in a ***whip-like*** motion.\nThis structural difference reflects evolutionary divergence between cell types."
  },
  {
    "title": "Smooth ER vs Rough ER",
    "ques": "How do the smooth and rough endoplasmic reticulum differ in structure and function within a eukaryotic cell?",
    "answer": {
      "type": "text",
      "content": "The rough ER has ribosomes and synthesizes proteins; the smooth ER lacks ribosomes and synthesizes lipids and detoxifies substances."
    },
    "explanation": "***Rough endoplasmic reticulum (RER)*** is covered in ```ribosomes```, giving it a bumpy appearance.\nIt’s mainly involved in ***protein synthesis and modification***.\n***Smooth endoplasmic reticulum (SER)*** has no ribosomes, giving it a smooth texture, and it’s involved in ***lipid synthesis, detoxification*** of drugs, and storage of calcium ions.\nThese differences reflect their ***specialized roles*** in eukaryotic cells."
  },
  {
    "title": "Crossing Over During Meiosis",
    "ques": "What is crossing over in meiosis and during which phase does it occur?",
    "answer": {
      "type": "text",
      "content": "Crossing over is the exchange of genetic material between homologous chromosomes, and it occurs during prophase I."
    },
    "explanation": "During ***prophase I*** of ***meiosis I***, homologous chromosomes pair up and exchange genetic material in a process called ***crossing over***.\nThis occurs at points called ```chiasmata```, where chromatids physically exchange segments.\nThis increases ***genetic variation*** in gametes, making each egg or sperm genetically unique."
  },
  {
    "title": "Fermentation vs Cellular Respiration",
    "ques": "How does fermentation differ from aerobic cellular respiration in terms of ATP yield and oxygen usage?",
    "answer": {
      "type": "text",
      "content": "Fermentation does not use oxygen and yields only 2 ATP per glucose molecule, while aerobic respiration uses oxygen and yields about 36–38 ATP."
    },
    "explanation": "***Fermentation*** is an ***anaerobic*** process, meaning it occurs without ```oxygen```.\nIt generates ***2 ATP*** per glucose molecule and results in byproducts like ***lactic acid or ethanol***.\nIn contrast, ***aerobic respiration*** uses oxygen and occurs in ***mitochondria***, yielding around ```36–38 ATP```, making it much more energy efficient."
  },
  {
    "title": "Facilitated Diffusion",
    "ques": "What is facilitated diffusion, and how does it differ from simple diffusion?",
    "answer": {
      "type": "text",
      "content": "Facilitated diffusion uses membrane proteins to transport substances across the membrane without energy input."
    },
    "explanation": "In ***facilitated diffusion***, molecules move down their concentration gradient through ```channel or carrier proteins```.\nThis allows transport of substances like ***glucose or ions*** that cannot pass through the lipid bilayer directly.\nUnlike ***active transport***, it doesn’t require ***ATP*** and unlike ***simple diffusion***, it requires ***specific transport proteins***."
  },
  {
    "title": "Binary Fission in Prokaryotes",
    "ques": "What is binary fission and how does it relate to cell division in prokaryotic cells?",
    "answer": {
      "type": "text",
      "content": "Binary fission is the asexual reproduction method in prokaryotes where the cell splits into two identical daughter cells."
    },
    "explanation": "***Binary fission*** is the primary mode of reproduction in ***prokaryotic cells*** like bacteria.\nThe circular DNA replicates, and the cell elongates before splitting into two via ***cytokinesis***.\nThis process is ***simpler and faster*** than mitosis and ensures that each daughter cell receives an identical copy of the genetic material."
  },
  {
    "title": "Endosymbiotic Theory",
    "ques": "What does the endosymbiotic theory suggest about the origin of mitochondria and chloroplasts?",
    "answer": {
      "type": "text",
      "content": "The theory suggests that mitochondria and chloroplasts originated as free-living prokaryotes that were engulfed by ancestral eukaryotic cells."
    },
    "explanation": "According to the ***endosymbiotic theory***, ***mitochondria*** and ***chloroplasts*** evolved from independent ***prokaryotic organisms***.\nThese were engulfed by a larger ancestral cell and formed a ***mutualistic relationship***.\nEvidence includes their own ```circular DNA```, ***double membranes***, and ***prokaryote-like ribosomes***, supporting the idea of an ancient symbiosis."
  },
  {
    "title": "Lysosomes and Cell Cleanup",
    "ques": "What is the role of lysosomes in a eukaryotic cell, and how do they maintain cellular health?",
    "answer": {
      "type": "text",
      "content": "Lysosomes contain digestive enzymes that break down waste, damaged organelles, and foreign invaders in the cell."
    },
    "explanation": "***Lysosomes*** are membrane-bound organelles in ***eukaryotic cells***.\nThey contain ```hydrolytic enzymes``` that digest unwanted materials.\nThis helps in ***cell cleanup***, recycling cellular components, and defending against pathogens.\nWithout lysosomes, harmful buildup would disrupt cellular function."
  },
  {
    "title": "G1 Checkpoint in Cell Cycle",
    "ques": "What does the G1 checkpoint monitor during the cell cycle, and what happens if errors are found?",
    "answer": {
      "type": "text",
      "content": "The G1 checkpoint checks for DNA damage and sufficient resources; if errors are detected, the cell may enter G0 or initiate repair mechanisms."
    },
    "explanation": "The ***G1 checkpoint*** is the first major control point in the ***cell cycle***.\nIt checks for adequate size, nutrient availability, and ***DNA integrity***.\nIf the cell doesn’t pass, it may pause to repair or enter a resting state called ```G0```.\nThis ensures ***genetic stability*** and prevents division of damaged cells."
  },
  {
    "title": "ATP Yield Comparison",
    "ques": "Which process produces more ATP per glucose molecule: glycolysis alone or complete aerobic respiration?",
    "answer": {
      "type": "text",
      "content": "Complete aerobic respiration produces significantly more ATP (around 36-38) compared to glycolysis alone (2 ATP)."
    },
    "explanation": "***Glycolysis***, occurring in the cytoplasm, yields only ```2 ATP``` per glucose.\nHowever, when ***aerobic respiration*** follows (including the Krebs cycle and electron transport chain in mitochondria), the total yield increases to about ```36–38 ATP```.\nThis highlights the efficiency of ***mitochondria*** in energy production under oxygen-rich conditions."
  },
  {
    "title": "Turgor Pressure and Osmosis",
    "ques": "How does osmosis help maintain turgor pressure in plant cells?",
    "answer": {
      "type": "text",
      "content": "Osmosis allows water to enter plant cells, filling the vacuole and pressing the membrane against the cell wall, creating turgor pressure."
    },
    "explanation": "***Osmosis*** is the passive movement of water into the cell through a semipermeable membrane.\nIn ***plant cells***, water accumulates in the large ```central vacuole```.\nThis causes the cytoplasm and membrane to press against the ***rigid cell wall***, generating ***turgor pressure***.\nTurgor pressure keeps plants firm and upright."
  },
  {
    "title": "Centrosomes in Mitosis",
    "ques": "What is the role of centrosomes during mitosis in animal cells?",
    "answer": {
      "type": "text",
      "content": "Centrosomes organize the spindle fibers that pull chromosomes apart during mitosis."
    },
    "explanation": "***Centrosomes*** are key microtubule-organizing centers in ***animal cells***.\nDuring ***prophase***, they migrate to opposite poles and form the ```mitotic spindle```.\nSpindle fibers attach to the ***centromeres*** of chromosomes and guide their movement during ***metaphase and anaphase***.\nThis ensures equal distribution of DNA to daughter cells."
  },
  {
    "title": "Cytoplasm in Prokaryotic vs. Eukaryotic Cells",
    "ques": "How does the role of the cytoplasm compare in prokaryotic and eukaryotic cells?",
    "answer": {
      "type": "text",
      "content": "In both cell types, the cytoplasm holds organelles and molecules, but in prokaryotes, all cellular processes occur in the cytoplasm due to lack of organelles."
    },
    "explanation": "***Cytoplasm*** is the fluid-like material that fills the interior of both ***prokaryotic and eukaryotic cells***.\nIn ***prokaryotes***, all processes—DNA replication, metabolism, protein synthesis—occur directly in the ```cytoplasm```.\nIn ***eukaryotes***, the cytoplasm surrounds organelles that compartmentalize these functions.\nSo while the basic medium is the same, ***functional organization differs***."
  },
  {
    "title": "Ribosomes in Prokaryotes and Eukaryotes",
    "ques": "Are ribosomes found in both prokaryotic and eukaryotic cells? If so, how do they differ?",
    "answer": {
      "type": "text",
      "content": "Yes, both have ribosomes. Prokaryotic ribosomes are smaller (70S) compared to eukaryotic ribosomes (80S)."
    },
    "explanation": "***Ribosomes*** are responsible for protein synthesis and are present in ***both cell types***.\nProkaryotic ribosomes are ***70S*** (composed of 50S and 30S subunits), while eukaryotic ribosomes are ***80S*** (60S + 40S).\nThis size difference is important in antibiotic targeting and reflects evolutionary divergence."
  },
  {
    "title": "Cytokinesis in Animal vs Plant Cells",
    "ques": "How does cytokinesis differ in animal and plant cells after mitosis?",
    "answer": {
      "type": "text",
      "content": "In animal cells, a cleavage furrow forms. In plant cells, a cell plate forms between the two nuclei."
    },
    "explanation": "After ***mitosis***, ***cytokinesis*** divides the cytoplasm.\nIn ***animal cells***, a ring of actin filaments pinches the cell in two via a ```cleavage furrow```.\nIn ***plant cells***, vesicles from the Golgi apparatus form a ```cell plate``` that becomes the new cell wall.\nThis structural difference is due to the presence of a ***rigid cell wall*** in plant cells."
  },
  {
    "title": "Importance of Surface Area-to-Volume Ratio",
    "ques": "Why is a high surface area-to-volume ratio important for cell function?",
    "answer": {
      "type": "text",
      "content": "It allows for efficient exchange of materials like nutrients and waste across the cell membrane."
    },
    "explanation": "A high ***surface area-to-volume ratio*** ensures that the cell can ***exchange gases, nutrients, and wastes*** efficiently.\nAs a cell grows, volume increases faster than surface area, reducing efficiency.\nThat’s why many cells are ***small or have extensions*** like microvilli to increase surface area.\nThis is a key constraint on ***cell size and shape***."
  },
  {
    "title": "Calvin Cycle and Light Dependency",
    "ques": "Does the Calvin cycle require light directly, and what are its main products?",
    "answer": {
      "type": "text",
      "content": "The Calvin cycle is light-independent and produces glucose precursors like G3P using ATP and NADPH from the light-dependent reactions."
    },
    "explanation": "The ***Calvin cycle*** occurs in the ***stroma*** of the chloroplast and is ***light-independent***.\nIt uses ```ATP``` and ```NADPH``` from the light-dependent stage to fix carbon dioxide.\nThe main product is ***G3P (glyceraldehyde-3-phosphate)***, a precursor to glucose and other sugars.\nThough it doesn't need light directly, it depends on products of the ***light reactions***."
  },
  {
    "title": "Hypertonic Solution Effect on Cells",
    "ques": "What happens to an animal cell placed in a hypertonic solution, and why?",
    "answer": {
      "type": "text",
      "content": "Water leaves the cell, causing it to shrink, because the external solute concentration is higher."
    },
    "explanation": "In a ***hypertonic solution***, the concentration of solutes is higher outside the cell than inside.\nDue to ***osmosis***, water moves out of the cell toward the area of higher solute concentration.\nThis results in ***cell shrinkage***, or crenation in animal cells.\nIt's a key principle in maintaining ***osmotic balance*** in cells."
  },
  {
    "title": "Function of Peroxisomes",
    "ques": "What is the function of peroxisomes in eukaryotic cells?",
    "answer": {
      "type": "text",
      "content": "Peroxisomes break down fatty acids and detoxify harmful substances like hydrogen peroxide."
    },
    "explanation": "***Peroxisomes*** are small, membrane-bound organelles in ***eukaryotic cells***.\nThey contain enzymes that ***oxidize fatty acids*** and detoxify substances like alcohol.\nA key enzyme, ```catalase```, converts harmful ***hydrogen peroxide (H₂O₂)*** into water and oxygen.\nThis protects the cell from ***oxidative damage***."
  }
]